Added usecase
